In [4]:
import pandas as pd

In [5]:
Rent = pd.read_excel('Data/statistic_id1156504_transportation-consumer-spending-per-capita-worldwide-2020-by-country.xlsx', sheet_name= 1)

In [6]:
Rent

     Unnamed: 0                                         Unnamed: 1  Unnamed: 2
0           NaN                                                NaN         NaN
1           NaN  Transportation consumer spending per capita wo...         NaN
2           NaN  Ranking of the per capita consumer spending on...         NaN
3           NaN                                                NaN         NaN
4           NaN                                         Luxembourg     5368.07
..          ...                                                ...         ...
146         NaN                                             Malawi       19.26
147         NaN                                             Gambia       16.60
148         NaN                                         Mozambique       14.14
149         NaN                                         Madagascar       13.39
150         NaN                                           Ethiopia        7.35

[151 rows x 3 columns]

In [7]:
Rent = Rent.drop(range(4))

In [8]:
Rent = Rent.drop(['Unnamed: 0'], axis =1)

In [9]:
Rent.columns = ['country', 'transport_spending_per_capita']

In [10]:
Rent

           country  transport_spending_per_capita
4       Luxembourg                        5368.07
5      Switzerland                        4988.37
6          Iceland                        3828.61
7    United States                        3673.39
8           Norway                        3582.28
..             ...                            ...
146         Malawi                          19.26
147         Gambia                          16.60
148     Mozambique                          14.14
149     Madagascar                          13.39
150       Ethiopia                           7.35

[147 rows x 2 columns]

In [11]:
import sqlalchemy

In [12]:
from sqlalchemy import engine

In [13]:
engine  = sqlalchemy.create_engine('postgresql://postgres:B3p1s0k.@localhost:5432/mydb')

In [14]:
Rent.to_sql('transport_spending', engine, if_exists= 'replace', index = False)

147